app/controllers/blog_page_controller.rb

  def recent
    @blogs = Blog.all
---
SELECT `blogs`.* FROM `blogs`

  def technology
    blog_title = BlogTitle.find_by_name('Technology')
    @blogs = Blog.where(blog_titles_id: blog_title.id )
---
SELECT  `blog_titles`.* FROM `blog_titles` WHERE `blog_titles`.`name` = 'Technology' LIMIT 1
SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`blog_titles_id` = 2

  def set_blog_titles
    @blog_titles = BlogTitle.all
---
SELECT `blog_titles`.* FROM `blog_titles`