app/controllers/blogs_controller.rb

  def show
    @blog = Blog.find(params[:id])
---
SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 0 LIMIT 1

  def create
    @blog = Blog.new(blog_params)

    # respond_to do |format|
    #   if @blog.save!
    #     format.html { redirect_to blogs_recent_path, notice: 'Blog was successfully created.' }
    #     #format.json { render :show, status: :created, location: @blog }
    #   else
    #     format.html { render :new }
    #     format.json { render json: @blog.errors, status: :unprocessable_entity }
    #   end
    # end
    @blog.save
---
INSERT INTO `blogs` (`blog_titles_id`, `title`, `description`, `created_at`, `updated_at`) VALUES (2, 'First Blog', '<p>Feels great to write a blog on your own blog platform. Thanks to&nbsp;god&nbsp;for doing it for me</p>', '2017-06-24 11:41:17', '2017-06-24 11:41:17')

    def set_blog
      @blog = Blog.find(params[:id])
---
SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = NULL LIMIT 1

    def set_blog_title
      @blog_titles = BlogTitle.all
---
SELECT `blog_titles`.* FROM `blog_titles`